Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: To retain the ability to turn CapsLock on and off, add the remapping +CapsLock::CapsLock first.
ja: CapsLockのオン/オフ機能を保持するには、まずリマッピング+CapsLock::CapsLockを追加する。

source: To retrieve 12-hour time as well as an AM/PM indicator, follow this example:
ja: 12時間表示とAM/PM表示を同時に取得するには、次のようにします：

source: To retrieve 12-hour time as well as an AM/PM indicator, follow this example: FormatTime(, "h:mm:ss tt")
ja: 12時間表示とAM/PM表示を同時に取得するには、次のようにします：FormatTime(, "h:mm:ss tt")

source: To retrieve a list of all controls in a window, follow this example:
ja: ウィンドウ内のすべてのコントロールのリストを取得するには、次の例に従う：

source: To retrieve a list of all controls in a window, use WinGetControls or WinGetControlsHwnd.
ja: ウィンドウ内のすべてのコントロールのリストを取得するには、WinGetControlsまたはWinGetControlsHwndを使用します。

source: To retrieve a zero-padded value, use the following:
ja: ゼロパディングされた値を取り出すには、以下のようにする：

source: To retrieve a zero-padded value, use the following: FormatTime(, "YDay0").
ja: ゼロパディングされた値を取り出すには、以下のようにする：FormatTime(, "YDay0")。

source: To retrieve all windows on the entire system, omit all four title/text parameters.
ja: システム全体のすべてのウィンドウを検索するには、4つのタイトル/テキストパラメータをすべて省略する。

source: To retrieve an array of all controls in a window, use WinGetControls or WinGetControlsHwnd.
ja: ウィンドウ内の全てのコントロールの配列を取得するには、WinGetControlsまたはWinGetControlsHwndを使用します。

source: To retrieve an environment variable, use EnvGet.
ja: 環境変数を取得する場合は、EnvGetを使用します。

source: To retrieve and operate upon multiple registry keys or values, consider using a registry loop.
ja: 複数のレジストリキーや値を取得し、操作するためにはレジストリループの利用を検討してください。

source: To retrieve and operate upon multiple registry keys or values, consider using a registry-loop.
ja: 複数のレジストリキーや値を取得し、操作するためには、レジストリループの使用を検討します。

source: To retrieve control-specific extended styles, use SendMessage, e.g. SendMessage(0x1037, 0, 0, MyListView) where 0x1037 is LVM_GETEXTENDEDLISTVIEWSTYLE.
ja: コントロール固有の拡張スタイルを取得するには、SendMessageを使用します。例：SendMessage (0x1037, 0, 0, MyListView)。ここで、0x1037は LVM_GETEXTENDEDLISTVIEWSTYLE です。

source: To retrieve files' relative paths instead of absolute paths during a recursive search, use SetWorkingDir to change to the base folder prior to the loop, and then omit the path from the Loop (e.g. Loop Files, "*.*", "R").
ja: 再帰検索で絶対パスではなく相対パスを取得するには、SetWorkingDirでループ前のベースフォルダに変更し、Loopでパスを省略します（例：Loop Files, "*.*", "R")。

source: To retrieve or set the text of a multi-line Edit control while also translating between `r`n and `n, use GuiCtrl.Value.
ja: 複数行のEditコントロールのテキストを取得または設定し、かつ`r`nと `nの間の翻訳を行うには、GuiCtrl.Valueを使用します。

source: To retrieve or set the text without translating `n to or from `r`n, use GuiCtrl.Text.
ja: nを`r`nに変換せずにテキストを取得または設定するには、GuiCtrl.Textを使用します。

source: To retrieve text from a ListView, ListBox, or ComboBox, use ListViewGetContent or ControlGetItems instead.
ja: ListView、ListBox、ComboBoxからテキストを取得する場合は、ListViewGetContentまたはControlGetItemsを代わりに使用してください。

source: To retrieve the class name without the sequence number, pass the control's HWND to WinGetClass.
ja: シーケンス番号を除いたクラス名を取得するには、WinGetClassにコントロールのHWNDを渡します。

source: To retrieve the complete 8.3 path and name for a single file or folder, specify its name for FilePattern as in this example:
ja: 一つのファイルやフォルダの8.3の完全なパスと名前を取得するには、この例のようにFilePatternにその名前を指定します：

source: To retrieve the control's new value, use GuiCtrlObj.Value.
ja: コントロールの新しい値を取得するには、GuiCtrlObj.Valueを使用します。

source: To retrieve the key name (if any), use GetKeyName(Format("vk{:x}sc{:x}", VK, SC)).
ja: キー名を取得する場合は、GetKeyName(Format("vk{:x}sc{:x}", VK, SC))を使用することです。

source: To retrieve the string itself, use StrGet:
ja: 文字列そのものを取得するには、StrGetを使用します：

source: To retrieve the widths of a ListView's columns -- for uses such as saving them to an INI file to be remembered between sessions -- follow this example:
ja: ListViewのカラムの幅を取得し、INIファイルに保存してセッション間で記憶させるなどの使い方をする場合は、次のようにします：

source: To retrieve values
ja: 値を取得する

source: To retrieve values:
ja: 値を取得する：

source: To return a COM-specific type of value, use ComValue(type, value).
ja: COM固有のタイプの値を返すには、ComValue(type, value)を使用します。

source: To return a COM-specific type of value, use ComValue.
ja: COM固有のタイプの値を返すには、ComValueを使用します。

source: To run a program such as mspaint.exe, calc.exe, script.ahk or even a folder, you can use the Run function.
ja: mspaint.exe、calc.exe、script.ahk、あるいはフォルダなどのプログラムを実行するには、「ファイル名を指定して実行」機能を使用します。

source: To run code when the last reference to an object is being released, implement the __Delete meta-function.
ja: オブジェクトへの最後の参照が解放されるときにコードを実行するには、__Deleteメタ関数を実装します。

source: To run multiple commands consecutively, use "&&" between each.
ja: 複数のコマンドを連続して実行する場合は、各コマンドの間に「&&」を使用します。

source: To save as UTF-8 in Notepad, select UTF-8 or UTF-8 with BOM from the Encoding drop-down in the Save As dialog.
ja: メモ帳でUTF-8として保存するには、「名前を付けて保存」ダイアログの「エンコード」ドロップダウンから、UTF-8またはUTF-8 with BOMを選択します。

source: To search for a simple substring inside a larger string, use InStr because it is faster than RegExMatch.
ja: 大きな文字列の中の単純な部分文字列を検索するには、RegExMatchよりも高速なInStrを使用します。

source: To select all items in a multi-select listbox, follow this example:
ja: マルチセレクトリストボックスのすべての項目を選択する場合は、次のようにします：

source: To select an item by its position number instead of its text, use GuiCtrl.Value.
ja: テキストではなく、位置番号で項目を選択する場合は、GuiCtrl.Valueを使用します。

source: To select multiple items with different text, call GuiCtrl.Choose repeatedly.
ja: テキストが異なる複数の項目を選択する場合は、GuiCtrl.Chooseを繰り返し呼び出します。

source: To select multiple items, call GuiCtrl.Choose repeatedly.
ja: 複数の項目を選択する場合は、GuiCtrl.Chooseを繰り返し呼び出します。

source: To select or deselect all items in a multi-select ListBox, follow this example:
ja: 多項目選択リストボックスの全項目を選択または選択解除するには、次のようにします：

source: To send a file to the recycle bin, use the FileRecycle function.
ja: ファイルをごみ箱に送るときは、FileRecycle関数を使ってください。

source: To send a key by name, or to send any one of the above symbols literally, enclose it in braces.
ja: キーを名前で送る場合、または上記の記号のいずれかを文字どおり送る場合は、中括弧で囲んでください。

source: To send a literal quote mark, you can enclose it in the opposite type of quote mark.
ja: 文字通りの引用符を送るには、逆のタイプの引用符で囲むとよいでしょう。

source: To send a message to all windows in the system, including those that are hidden or disabled, specify 0xFFFF for WinTitle (0xFFFF is HWND_BROADCAST).
ja: 非表示や無効になっているものも含め、システム内のすべてのウィンドウにメッセージを送るには、WinTitleに 0xFFFFを指定します（0xFFFFはHWND_BROADCAST）。

source: To send an extra space or tab after a replacement, include the space or tab at the end of the replacement but make the last character an accent/backtick (`).
ja: 置換の後にスペースやタブを追加して送信するには、置換の最後にスペースやタブを含め、最後の文字をアクセント/バックティック(`)にします。

source: To send the corresponding modifier key on its own, enclose the key name in braces.
ja: 対応する修飾キーを単独で送信する場合は、キー名を中括弧で囲んでください。

source: To send the ending character itself, use SendText A_EndChar (SendText is used because characters such as !{} would not be sent correctly by the normal Send function).
ja: 終了文字そのものを送信する場合は、SendText A_EndCharを使用します（SendTextを使用するのは、!{}などの文字が通常のSend関数では正しく送信されないためです）。

source: To separate the year from the week, use Year := SubStr(A_YWeek, 1, 4) and Week := SubStr(A_YWeek, -2).
ja: 年と週を分けるには、Year := SubStr(A_YWeek, 1, 4)、Week := SubStr(A_YWeek, -2)を使う。

source: To set new default options for subsequently created hotstrings, pass the options to the Hotstring function without any leading or trailing colon.
ja: その後に作成されるホットストリングに新しいデフォルトオプションを設定するには、Hotstring関数にオプションを先頭や末尾のコロンを付けずに渡します。

source: To set the selection range, follow this example, which sets the starting position to 55 and the ending position to 66:
ja: 選択範囲を設定するには、この例に従って、開始位置を55に、終了位置を66に設定する：

source: To set transparency, use WinSetTransparent.
ja: 透明度を設定するには、WinSetTransparent関数を使用します。

source: To set values
ja: 値を設定する

source: To set values:
ja: 値を設定する：

source: To show contents of a variable, use MsgBox or ToolTip.
ja: 変数の内容を表示するには、MsgBoxまたはToolTipを使用します。

source: To shrink or enlarge the image while preserving its aspect ratio, specify -1 for one of the dimensions and a positive number for the other.
ja: 画像のアスペクト比を保ったまま縮小・拡大する場合は、一方の寸法に-1、他方の寸法に正の数を指定します。

source: To solve this, use HotIf to set the criteria to match those of the hotkey to be modified.
ja: これを解決するには、HotIfを使用して、変更するホットキーの条件と一致するように設定します。

source: To sort the table by another column or in another order, click on a column header.
ja: 別の列または別の順序で表を並べ替えるには、列のヘッダーをクリックする。

source: To specify a different scrolling width, include a number immediately after the word HScroll.
ja: 異なるスクロール幅を指定する場合は、HScrollという文字の直後に数字を含めてください。

source: To specify a literal $, use $$ (this is the only character that needs such special treatment; backslashes are never needed to escape anything).
ja: リテラルで$を指定する場合は$$を使用します（このような特別な扱いが必要な文字はこの文字だけで、バックスラッシュは何もエスケープする必要はありません）。

source: To specify an owner window for the message box, use the word Owner followed immediately by a HWND (window ID).
ja: メッセージボックスのオーナーウィンドウを指定するには、Ownerという単語の直後にHWND（ウィンドウID）を使用します。

source: To specify code that executes only when Try catches an error, use one or more Catch statements.
ja: Tryがエラーをキャッチしたときだけ実行するコードを指定するには、1つ以上のCatchステートメントを使用します。

source: To specify more than one option, include a space between each.
ja: 複数のオプションを指定する場合は、各オプションの間にスペースを入れてください。

source: To specify other options, add one or more of the following values:
ja: その他のオプションを指定する場合は、以下の値を1つ以上追加してください：

source: To specify the buffer size in bytes, use a Buffer-like object in the Target parameter.
ja: バッファサイズをバイト単位で指定するには、TargetパラメータにBufferライクなオブジェクトを使用します。

source: To specify which character is used, follow this example:
ja: どの文字を使うかを指定するには、この例に従います：

source: To split a string that is in standard CSV (comma separated value) format, use a parsing loop since it has built-in CSV handling.
ja: 標準的なCSV（カンマ区切り値）形式の文字列を分割するには、CSV処理が組み込まれている構文解析ループを使用する。

source: To start a new line in a multi-line edit control, the last parameter (contents) may contain either a solitary linefeed (`n) or a carriage return and linefeed (`r`n).
ja: 複数行の編集コントロールで改行するには、最後のパラメータ（contents）に単独のラインフィード（`n）またはキャリッジリターンとラインフィード（`r`n）を指定します。

source: To start creating your own macros and hotkeys right away, please read the Quick-start Tutorial.
ja: 独自のマクロやホットキーをすぐに作成するには、クイックスタート・チュートリアルをお読みください。

source: To stop a file that is currently playing, use SoundPlay on a nonexistent filename as in this example:
ja: 再生中のファイルを停止するには、この例のように、存在しないファイル名でSoundPlayを使う：

source: To stop a file that is currently playing, use SoundPlay on a nonexistent filename as in this example: try SoundPlay "Nonexistent.avi".
ja: 再生中のファイルを停止するには、この例のように、存在しないファイル名でSoundPlayを使う：try SoundPlay "存在しない.avi"。

source: To stop an action that is repeating inside a Loop, consider the following working example, which is a hotkey that both starts and stops its own repeating action.
ja: ループ内で繰り返されるアクションを停止するには、次のような動作例を考えてみましょう。このホットキーは、それ自体が繰り返されるアクションの開始と停止の両方を行います。

source: To stop monitoring the message, use OnMessage(x, MyFunc, 0) as OnMessage(x, "") and OnMessage(x) are now errors.
ja: OnMessage(x,"")とOnMessage(x)がエラーになったので、メッセージの監視を止めるには、OnMessage(x, MyFunc, 0)を使います。

source: To stop this pattern from matching the entire string <em>text</em>, append a question mark to the plus sign:
ja: このパターンが、<em>text</em>文字列全体にマッチしないようにするには、プラス記号にクエスチョンマークを追加する：

source: To stop this pattern from matching the entire string <em>text</em>, append a question mark to the plus sign: <.+?>.
ja: このパターンが、<em>text</em>文字列全体にマッチしないようにするには、プラス記号にクエスチョンマークを追加する：<.+?>。

source: To take advantage of this, the shorthand statement if Done can be used to check whether the variable Done is true or false.
ja: これを利用するために、if Doneという省略記法を使えば、変数Doneが真か偽かをチェックすることができます。

source: To test this example, right-click the tray icon and click Exit.
ja: この例を試すには、トレイアイコンを右クリックし、Exitをクリックします。

source: To test this example, type [ followed by one of the abbreviations listed below, any other 5 characters, or Enter/Esc/Tab/.; or wait for 4 seconds.
ja: この例をテストするには、[の後に以下の略語の1つ、その他の5文字、または Enter/Esc/Tab/.を入力するか、4秒間待つ。

source: To the right of all previous controls (maximum X extent plus margin).
ja: 以前のすべてのコントロールの右側（最大X範囲＋マージン）。

source: To the right of all previous controls since the most recent use of the Section option.
ja: セクションオプションの直近の使用以降、以前のすべてのコントロールの右側にある。

source: To the right of the previous control (right edge plus margin).
ja: 前のコントロールの右側（右端＋マージン）。

source: To translate a block of text containing `n characters, follow this example:
ja: n文字を含むテキストブロックを翻訳する場合は、次の例に従います：

source: To truly comment out this directive, insert a space after the first comment flag.)
ja: このディレクティブを本当にコメントアウトするには、最初のコメントフラグの後にスペースを挿入する。）

source: To turn off context sensitivity (such as to make subsequently-created hotkeys work in all windows), call any HotIf function but omit the parameters.
ja: 文脈依存性をオフにするには（その後に作成したホットキーがすべてのウィンドウで機能するようにするなど）、HotIf関数を呼び出して、パラメータを省略します。

source: To turn off context sensitivity for subsequent hotkeys or hotstrings, specify #HotIf without its parameter.
ja: それ以降のホットキーまたはホットストリングのコンテキスト感度をオフにするには、パラメータなしで#HotIfを指定します。

source: To turn off context sensitivity, specify #HotIf without any expression.
ja: 文脈依存性をオフにするには、#HotIfを無表現で指定します。

source: To turn off the monitor, see SendMessage example #1.
ja: モニターをオフにするには、SendMessage関数の例1をご覧ください。

source: To underline one of the letters in a menu item's name, precede that letter with an ampersand (&).
ja: メニュー名の1文字に下線を引くには、その文字の前にアンパサンド（&）を付けます。

source: To undo this, all you need to do is exit the script.
ja: これを元に戻すには、スクリプトを終了させればよい。

source: To unhide a template, delete the corresponding registry value from HKCU\Software\AutoHotkey\New\HideTemplate.
ja: テンプレートの非表示を解除するには、HKCU\Software\AutoHotkey\New\HideTemplateから対応するレジストリ値を削除する。

source: To uninstall:
ja: アンインストールする：

source: To unlock a drive, call DriveUnlock.
ja: ドライブのロックを解除するには、DriveUnlockを呼び出します。

source: To unregister a function object, specify 0 for MaxThreads:
ja: 関数オブジェクトの登録を解除するには、MaxThreadsに0を指定します：

source: To use Ctrl, Alt, or Shift as end-keys, specify the left and/or right version of the key, not the neutral version.
ja: Ctrl、Alt、Shiftをエンドキーとして使用する場合は、ニュートラルキーではなく、左または右のバージョンを指定してください。

source: To use a dynamic property name, enclose the sub-expression in percent signs.
ja: ダイナミック・プロパティ名を使うには、部分式をパーセント記号で囲む。

source: To use a local account, leave this blank.
ja: ローカルアカウントを使用する場合は、空欄のままにしてください。

source: To use a part other than the first, specify 1 for second, 2 for the third, etc.
ja: 1番以外のパートを使用する場合は、2番には1、3番には2などを指定する。

source: To use a specific locale, specify the letter L followed by a hexadecimal or decimal locale identifier (LCID).
ja: 特定のロケールを使用する場合は、文字Lの後に16進数または10進数のロケール識別子（LCID）を指定してください。

source: To use a string as a delimiter rather than a character, first use StrReplace to replace all occurrences of the string with a single character that is never used literally in the text, e.g. one of these special characters:
ja: 文字列を文字ではなく区切り文字として使用するには、まずStrReplaceを使用して、文字列のすべての出現箇所を、テキスト内で文字通り使用されることのない単一の文字（例えば、これらの特殊文字のいずれか）に置き換えます：

source: To use a string as a delimiter rather than a character, first use StrReplace to replace all occurrences of the string with a single character that is never used literally in the text, e.g. one of these special characters: ¢¤¥¦§©ª«®µ¶.
ja: 文字列を文字ではなく区切り文字として使用するには、まずStrReplaceを使用して、文字列のすべての出現箇所を、テキスト内で文字通り使用されることのない単一の文字（例えば、これらの特殊文字のいずれか）に置き換えます：¢¤¥¦§©ª«®µ¶。

source: To use an alternate mode for a particular drag, follow this example:
ja: 特定のドラッグにオルタネートモードを使用する場合は、次の例に従います：

source: To use an alternate mode for a particular drag, follow this example: SendEvent "{Click 6 52 Down}{Click 45 52 Up}".
ja: 特定のドラッグにオルタネートモードを使用する場合は、次の例に従います：SendEvent "{Click 6 52 Down}{Click 45 52 Up}"。

source: To use an alternate mode for a particular rotation, follow this example:
ja: 特定の回転にオルタネートモードを使用するには、次の例に従います：

source: To use an alternate mode for a particular rotation, follow this example: SendEvent "{WheelDown 5}".
ja: 特定の回転にオルタネートモードを使用するには、次の例に従います：SendEvent "{WheelDown 5}"。

source: To use an icon group other than the first one in the file, specify *Icon followed immediately by the number of the group.
ja: ファイル内の先頭以外のアイコングループを使用する場合は、*Iconの後にグループの番号を続けて指定してください。

source: To use an icon group other than the first one in the file, specify its number for IconNumber (if omitted, it defaults to 1).
ja: ファイルの先頭以外のアイコングループを使用する場合は、IconNumberにその番号を指定します（省略した場合はデフォルトで1）。

source: To use an icon group other than the first one in the file, specify its number for IconNumber.
ja: ファイルの先頭以外のアイコングループを使用する場合は、IconNumberにその番号を指定します。

source: To use an icon in IconFile other than the first, specify that number here.
ja: IconFileにあるアイコンのうち、先頭以外のアイコンを使用する場合は、ここでその番号を指定します。

source: To use an icon or bitmap handle in place of an image filename, use the following syntax:
ja: 画像ファイル名の代わりにアイコンやビットマップハンドルを使うには、以下の構文を使います：

source: To use exactly the same position, specify xp yp together.
ja: 全く同じ位置を使用する場合は、xp ypを一緒に指定してください。

source: To use it, simply omit all four window parameters (WinTitle, WinText, ExcludeTitle, and ExcludeText).
ja: これを使うには、4つのウィンドウ・パラメーター（WinTitle、WinText、ExcludeTitle、ExcludeText）をすべて省略すればよい。

source: To use more than one modifier with a hotkey, list them consecutively (the order does not matter).
ja: 1つのホットキーで複数のモディファイアを使用する場合は、連続してリストアップしてください（順番は関係ありません）。

source: To use nested functions or closures, attach them to an object and pass the object as described below.
ja: ネストされた関数やクロージャを使用するには、以下のようにオブジェクトにアタッチしてオブジェクトを渡します。

source: To use one of the other views, specify its name in the options list.
ja: 他のビューを使用する場合は、オプションリストでその名前を指定します。

source: To use only the standard vertical margin, specify y+m or any value for X.
ja: 標準の垂直マージンのみを使用する場合は、y+mまたはXに任意の値を指定してください。

source: To use only the standard vertical margin, specify Y+M or any value for X.
ja: 標準の垂直マージンのみを使用する場合は、Y+MまたはXに任意の値を指定してください。

source: To use the + or ^ prefix literally in an expression, the prefix or value must be enclosed in quote marks.
ja: プレフィックス + または ^ を文字どおり式の中で使うには、プレフィックスまたは値を引用符で囲む必要があります。

source: To use the braces themselves as end keys, specify {{} and/or {}}.
ja: 中括弧そのものを終了キーとして使用する場合は、{{}と {}}を指定します。

source: To use the parentheses without the side-effect of capturing a subpattern, specify ?: as the first two characters inside the parentheses; for example:
ja: サブパターンを捕捉する副作用を伴わずに括弧を使用するには、括弧内の最初の2文字に?:を指定する：

source: To use the parentheses without the side-effect of capturing a subpattern, specify ?: as the first two characters inside the parentheses; for example: (?:.*)
ja: サブパターンを捕捉する副作用を伴わずに括弧を使用するには、括弧内の最初の2文字に?:を指定する：(?:.*)

source: To use the system's locale instead, specify LSys.
ja: 代わりにシステムのロケールを使用する場合は、LSysを指定します。

source: To use this, save and run both of the following scripts then press Win+Space to show an input box that will prompt you to type in a string.
ja: これを使うには、次の2つのスクリプトを保存して実行し、Win+Spaceを押して入力ボックスを表示し、文字列を入力するよう促します。

source: To visually move the mouse more slowly -- such as a script that performs a demonstration for an audience -- use SendEvent "{Click 100 200}" or SendMode "Event" (optionally in conjuction with BlockInput).
ja: デモンストレーション用のスクリプトのためなどにマウスを視覚的にゆっくりと動かすには、SendEvent "{Click 100 200}"またはSendMode "Event"を使用します（必要に応じてBlockInputと組み合わせてください）。

source: To visually move the mouse more slowly -- such as a script that performs a demonstration for an audience -- use SendEvent {Click 100 200} or SendMode Event (optionally in conjuction with BlockInput).
ja: 観客に向けてデモンストレーションを行うスクリプトのように、視覚的にゆっくりとマウスを動かしたい場合は、次のようにします。 SendEvent {Click 100 200}またはSendModeEvent（オプションでBlockInputと併用する）。

source: To wait for a fraction of a second, specify a floating point value for the first parameter, for example, 0.25 to wait for a maximum of 250 milliseconds.
ja: 秒単位で待機する場合は、第1パラメータに浮動小数点値を指定します。例えば、最大250ミリ秒待機する場合は、0.25と指定します。

source: To wait for a fraction of a second, specify a floating-point number, for example, 0.25 to wait for a maximum of 250 milliseconds.
ja: 1秒未満の時間を待機するには、浮動小数点数を指定します。たとえば最大250ミリ秒待機するときは、0.25と指定します。

source: To wait for a key or mouse/joystick button to achieve a new state, it is usually easier to use KeyWait instead of a GetKeyState loop.
ja: キーやマウス・ジョイスティックボタンが新しい状態になるのを待つには、通常、GetKeyStateループの代わりにKeyWaitを使用するのが簡単です。

source: To wait for any one key among a set of keys to be pressed down, see the examples section of the InputHook function.
ja: 一連のキーのうち、任意の1つのキーが押下されるのを待つには、InputHook関数の例のセクションを参照してください。

source: To wait for at least one window to be created, use WinWait "ahk_pid " OutputVarPID.
ja: 少なくとも1つのウィンドウが作成されるのを待つには、WinWait "ahk_pid " OutputVarPIDを使用します。

source: To wait for two or more keys to be released, use KeyWait consecutively.
ja: 2つ以上のキーが離されるのを待つには、KeyWaitを連続して使用します。

source: To work around this, Suspend can be turned on temporarily (which disables all hotstrings).
ja: これを回避するために、サスペンドを一時的にオンにすることができます（これはすべてのホットストリングを無効にします）。

source: To work around this, avoid using SendMode "Play" during script startup when you have remappings; then use the function SendPlay vs. Send in other places throughout the script.
ja: これを回避するには、リマッピングがある場合は、スクリプトの起動時にSendMode "Play"を使用しないようにします。そして、スクリプト中の他の場所で、関数SendPlay対Sendを使う。

source: To work around this, avoid using timers whose subroutines take a long time to finish, or disable all timers during the dialog:
ja: これを回避するには、サブルーチンの終了に時間がかかるタイマーの使用を避けるか、ダイアログ中のタイマーをすべて無効にしてください：

source: To work around this, change the two underlined "Str" values above to Ptr.
ja: これを回避するには、上記の下線部の2つの「Str」の値をPtrに変更します。

source: To work around this, don't make such hotstrings auto-replace.
ja: これを回避するためには、このようなホットストリングを自動置換しないようにします。

source: To work around this, first copy it to a destination outside itself, then use DirMove to move that copy to the desired location.
ja: これを回避するには、まず自分以外の場所にコピーし、そのコピーをDirMoveで目的の場所に移動させます。

source: To work around this, rename the files only after creating a list of them.
ja: これを回避するには、ファイルのリストを作成した後にのみファイル名を変更します。

source: To work around this, try the shades-of-variation option (*n) or make the window temporarily opaque via WinSetTransparent("Off").
ja: これを回避するには、shades-of-variationオプション（*n）を試すか、WinSetTransparent("Off")でウィンドウを一時的に不透明にする必要があります。

source: To work around this, use MenuSelect.
ja: これを回避するためには、MenuSelect関数を使用します。

source: To work around this, use SendEvent.
ja: これを回避するためには、SendEventを使用します。

source: To work around this, use KeyWait to wait for the keys to be released; for example:
ja: これを回避するには、KeyWaitを使用して、キーが解放されるのを待ちます：

source: To work around this, use A_WinDir "\SysNative" instead; this is a virtual directory only visible to 32-bit programs running on 64-bit systems.
ja: これは、A_WinDir "\SysNative"を代わりに使用; 64ビットシステム上で動作する32ビットプログラムにのみ表示される仮想ディレクトリです。

source: To work around this, use a non-auto-replace hotstring and the SendEvent function.
ja: これを回避するには、自動置換されないホットストリングとSendEvent関数を使用します。

source: To work around this, use either SendEvent "!{Left}" or SendInput "{Backspace}".
ja: これを回避するには、SendEvent "!{Left}"またはSendInput "{Backspace}"のいずれかを使用します。

source: To work around this, use other file types such as .mp3 (with a path length of up to 255 characters) or use 8.3 short paths (see A_LoopFileShortPath how to retrieve such paths).
ja: これを回避するには、.mp3（パスの長さは255文字まで）などの他のファイルタイプを使用するか、8.3のショートパスを使用します（そのようなパスを取得する方法については、A_LoopFileShortPathを参照してください）。

source: To workaround this, specify -Background and/or cDefault in the tab control's options.
ja: これを回避するには、タブコントロールのオプションで-BackgroundやcDefaultを指定する。

source: To write a standalone post-increment or post-decrement expression, either omit the space between the variable and the operator, or wrap the variable or expression in parentheses.
ja: 単独でポストインクリメント式やポストデクリメント式を書くには、変数と演算子の間のスペースを省くか、変数や式を括弧で囲むかします。

source: To write a standalone ternary expression with a complex condition, enclose the condition in parentheses.
ja: 複雑な条件を持つ単体の3元式を書くには、条件を括弧で囲みます。
